;***************************************
;Passive Armour Icons - dlc ruler armour panics
;***************************************

[SerpentPanicPassive X2AbilityTemplate]
LocFriendlyName="Serpentine Bane"
LocLongDescription="Vipers have a chance to panic on sight of this unit."
LocHelpText="Vipers have a chance to panic on sight of this unit."

[RagePanicPassive X2AbilityTemplate]
LocFriendlyName="Taurian Bane"
LocLongDescription="Mutons and Berserkers have a chance to panic on sight of this unit."
LocHelpText="Mutons and Berserkers have a chance to panic on sight of this unit."

[IcarusPanicPassive X2AbilityTemplate]
LocFriendlyName="Icarus Bane"
LocLongDescription="Archons have a chance to panic on sight of this unit."
LocHelpText="Archons have a chance to panic on sight of this unit."

;***************************************
;Passive Vest Icons - Base Game
;***************************************

[StasisVest X2EquipmentTemplate]
FriendlyName="Stasis Vest"
FriendlyNamePlural="Stasis Vests"
BriefSummary="This upgraded vest grants an additional <Ability:StasisVest_BonusHP/> health to a soldier. Its built-in Medikit IV will automatically restore health to wounded soldiers and prevent them from taking bleeding damage."
TacticalText="<Bullet/> Increases soldier health by <Ability:StasisVest_BonusHP/>.\n<Bullet/> Provides <Ability:StasisVest_Regen/> HP regeneration bonus every turn up to a maximum <Ability:StasisVest_MaxRegen/> HP restored per mission.\n<Bullet/> Grants immunity to bleeding damage."

[StasisVestBonus X2AbilityTemplate]
LocFriendlyName="Stasis Vest"
LocLongDescription="Immunity to bleeding.\nRegenerate lost health over time up to a maximum."
LocHelpText="Immunity to bleeding.\nRegenerate lost health over time up to a maximum."

[ScorchCircuits X2AbilityTemplate]
LocFriendlyName="Hellweave Vest"
LocLongDescription="Immunity to Fire and Chryssalid Venom.\nAutomatically inflicts fire damage on any melee attackers."
LocHelpText="Immunity to fire and Chryssalid Venom.\nAutomatically inflicts fire damage on any melee attackers."

[ScorchCircuitsDamage X2AbilityTemplate]
LocFriendlyName="Hellweave Vest"
LocLongDescription="Immunity to Fire and Chryssalid Venom.\nAutomatically inflicts fire damage on any melee attackers."
LocHelpText="Immunity to fire and Chryssalid Venom.\nAutomatically inflicts fire damage on any melee attackers."
LocFlyOverText="Hellweave"

[HazmatVest X2EquipmentTemplate]
FriendlyName="Hazmat Suit"
FriendlyNamePlural="Hazmat Suits"
BriefSummary="Provides immunity to all known hazardous elements."
TacticalText="Immunity to acid, electrical, fire, frost, poison and chryssalid venom."

[HazmatVestBonus X2AbilityTemplate]
LocFriendlyName="Hazmat Suit"
LocLongDescription="Immunity to acid, electrical, fire, frost, poison and chryssalid venom."
LocHelpText="Immunity to acid, electrical, fire, frost, poison and chryssalid venom."

[WallPhasing X2AbilityTemplate]
LocFriendlyName="Wraith"
LocLongDescription="This armor allows the unit to pass directly through obstacles."
LocHelpText="This armor incorporates a dimensional shift to allow the wearer to pass freely through obstacles."
LocFlyOverText="Phased"

;***************************************
;Passive Utility Icons - Base Game
;***************************************

[MedikitBonus X2AbilityTemplate]
LocFriendlyName="Basic Medikit"
LocLongDescription="Immunity to poison."
LocHelpText="Immunity to poison."

[NanoMedikitBonus X2AbilityTemplate]
LocFriendlyName="Nano Medikit"
LocLongDescription="Immunity to poison and chryssalid venom."
LocHelpText="Immunity to poison and chryssalid venom."

[MindShield X2AbilityTemplate]
LocFriendlyName="Mindshield"
LocLongDescription="Immunity to disorient, knockout, panic, stun and most mental effects."
LocHelpText="Immunity to disorient, knockout, panic, stun and most mental effects."
LocFlyOverText="Mind Shield"

;***************************************
;Passive Icons - Additional Pure Passive
; Just couldn't find another way to add the passive from the PCS to the tactical summary
; Don't hate me @MrShadowCX :)
;***************************************

;;[BioDamageControl X2AbilityTemplate]
;;	original mod localisation
;;	LocFriendlyName="Armor Generation"
;;	LocLongDescription="Floods the body with a mucus-like agent that hardens to form a temporary armor."
;;	LocHelpText="Bio Damage Control Armor Generation. 1 Armor generated each time damage is taken for that round of combat. Resets the start of the next combat phase."
;;	LocFlyOverText="Armor Generation" 

;;[PCSBioDamageControl X2EquipmentTemplate]
;;	FriendlyName="<font color='#69CA24'>PCS: Bio Damage Control</font>"
;;	FriendlyNamePlural="<font color='#69CA24'>PCS: Bio Damage Control</font>"
;;	BriefSummary="Floods the body with a reworked mucus-like agent that hardens to form a temporary armor as well as granting a small defense bonus."

;; added localisation and a new passive ability so that it can show in tactical
;; copy of original ability and merge of PCS item localisation
;; ~adjusted name for XCom display~
[BioDamageControlPassive X2AbilityTemplate]
LocFriendlyName="Bio PCS: Damage Control"
LocLongDescription="<font color = '#FA6942'>*****</font>\nFloods the body with a mucus-like agent that hardens to form a temporary armor.\nArmor is generated each time damage is taken.\nResets at the start of the next combat phase."
